Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS60/include/pio/pic32cm1216ls60100.h
#define PIN_PA00B_OPAMP_OANEG1                     _UL_(0)     
#define MUX_PA00B_OPAMP_OANEG1                     _UL_(1)     
#define PINMUX_PA00B_OPAMP_OANEG1                  ((PIN_PA00B_OPAMP_OANEG1 << 16) | MUX_PA00B_OPAMP_OANEG1)
#define PORT_PA00B_OPAMP_OANEG1                    (_UL_(1) << 0)

#define PIN_PA03B_OPAMP_OANEG2                     _UL_(3)     
#define MUX_PA03B_OPAMP_OANEG2                     _UL_(1)     
#define PINMUX_PA03B_OPAMP_OANEG2                  ((PIN_PA03B_OPAMP_OANEG2 << 16) | MUX_PA03B_OPAMP_OANEG2)
#define PORT_PA03B_OPAMP_OANEG2                    (_UL_(1) << 3)

#define PIN_PA07B_OPAMP_OAOUT0                     _UL_(7)     
#define MUX_PA07B_OPAMP_OAOUT0                     _UL_(1)     
#define PINMUX_PA07B_OPAMP_OAOUT0                  ((PIN_PA07B_OPAMP_OAOUT0 << 16) | MUX_PA07B_OPAMP_OAOUT0)
#define PORT_PA07B_OPAMP_OAOUT0                    (_UL_(1) << 7)

#define PIN_PB04B_OPAMP_OAOUT1                     _UL_(36)    
#define MUX_PB04B_OPAMP_OAOUT1                     _UL_(1)     
#define PINMUX_PB04B_OPAMP_OAOUT1                  ((PIN_PB04B_OPAMP_OAOUT1 << 16) | MUX_PB04B_OPAMP_OAOUT1)
#define PORT_PB04B_OPAMP_OAOUT1                    (_UL_(1) << 4)

#define PIN_PA04B_OPAMP_OAOUT2                     _UL_(4)     
#define MUX_PA04B_OPAMP_OAOUT2                     _UL_(1)     
#define PINMUX_PA04B_OPAMP_OAOUT2                  ((PIN_PA04B_OPAMP_OAOUT2 << 16) | MUX_PA04B_OPAMP_OAOUT2)
#define PORT_PA04B_OPAMP_OAOUT2                    (_UL_(1) << 4)

#define PIN_PA06B_OPAMP_OAPOS0                     _UL_(6)     
#define MUX_PA06B_OPAMP_OAPOS0                     _UL_(1)     
#define PINMUX_PA06B_OPAMP_OAPOS0                  ((PIN_PA06B_OPAMP_OAPOS0 << 16) | MUX_PA06B_OPAMP_OAPOS0)
#define PORT_PA06B_OPAMP_OAPOS0                    (_UL_(1) << 6)

#define PIN_PA01B_OPAMP_OAPOS1                     _UL_(1)     
#define MUX_PA01B_OPAMP_OAPOS1                     _UL_(1)     
#define PINMUX_PA01B_OPAMP_OAPOS1                  ((PIN_PA01B_OPAMP_OAPOS1 << 16) | MUX_PA01B_OPAMP_OAPOS1)
#define PORT_PA01B_OPAMP_OAPOS1                    (_UL_(1) << 1)

#define PIN_PA05B_OPAMP_OAPOS2                     _UL_(5)     
#define MUX_PA05B_OPAMP_OAPOS2                     _UL_(1)     
#define PINMUX_PA05B_OPAMP_OAPOS2                  ((PIN_PA05B_OPAMP_OAPOS2 << 16) | MUX_PA05B_OPAMP_OAPOS2)
#define PORT_PA05B_OPAMP_OAPOS2                    (_UL_(1) << 5)

/* ========== PORT definition for PTC peripheral ========== */
#define PIN_PA00F_PTC_DRV0                         _UL_(0)     
#define MUX_PA00F_PTC_DRV0                         _UL_(5)     
#define PINMUX_PA00F_PTC_DRV0                      ((PIN_PA00F_PTC_DRV0 << 16) | MUX_PA00F_PTC_DRV0)
#define PORT_PA00F_PTC_DRV0                        (_UL_(1) << 0)

#define PIN_PA01F_PTC_DRV1                         _UL_(1)     
#define MUX_PA01F_PTC_DRV1                         _UL_(5)     
#define PINMUX_PA01F_PTC_DRV1                      ((PIN_PA01F_PTC_DRV1 << 16) | MUX_PA01F_PTC_DRV1)
#define PORT_PA01F_PTC_DRV1                        (_UL_(1) << 1)

#define PIN_PA02F_PTC_DRV2                         _UL_(2)     
#define MUX_PA02F_PTC_DRV2                         _UL_(5)     
#define PINMUX_PA02F_PTC_DRV2                      ((PIN_PA02F_PTC_DRV2 << 16) | MUX_PA02F_PTC_DRV2)
#define PORT_PA02F_PTC_DRV2                        (_UL_(1) << 2)

#define PIN_PA03F_PTC_DRV3                         _UL_(3)     
#define MUX_PA03F_PTC_DRV3                         _UL_(5)     
#define PINMUX_PA03F_PTC_DRV3                      ((PIN_PA03F_PTC_DRV3 << 16) | MUX_PA03F_PTC_DRV3)
#define PORT_PA03F_PTC_DRV3                        (_UL_(1) << 3)

#define PIN_PA05F_PTC_DRV4                         _UL_(5)     
#define MUX_PA05F_PTC_DRV4                         _UL_(5)     
#define PINMUX_PA05F_PTC_DRV4                      ((PIN_PA05F_PTC_DRV4 << 16) | MUX_PA05F_PTC_DRV4)
#define PORT_PA05F_PTC_DRV4                        (_UL_(1) << 5)

#define PIN_PA06F_PTC_DRV5                         _UL_(6)     
#define MUX_PA06F_PTC_DRV5                         _UL_(5)     
#define PINMUX_PA06F_PTC_DRV5                      ((PIN_PA06F_PTC_DRV5 << 16) | MUX_PA06F_PTC_DRV5)
#define PORT_PA06F_PTC_DRV5                        (_UL_(1) << 6)

#define PIN_PA08F_PTC_DRV6                         _UL_(8)     
#define MUX_PA08F_PTC_DRV6                         _UL_(5)     
#define PINMUX_PA08F_PTC_DRV6                      ((PIN_PA08F_PTC_DRV6 << 16) | MUX_PA08F_PTC_DRV6)
#define PORT_PA08F_PTC_DRV6                        (_UL_(1) << 8)

#define PIN_PA09F_PTC_DRV7                         _UL_(9)     
#define MUX_PA09F_PTC_DRV7                         _UL_(5)     
#define PINMUX_PA09F_PTC_DRV7                      ((PIN_PA09F_PTC_DRV7 << 16) | MUX_PA09F_PTC_DRV7)
#define PORT_PA09F_PTC_DRV7                        (_UL_(1) << 9)

#define PIN_PA10F_PTC_DRV8                         _UL_(10)    
#define MUX_PA10F_PTC_DRV8                         _UL_(5)     
#define PINMUX_PA10F_PTC_DRV8                      ((PIN_PA10F_PTC_DRV8 << 16) | MUX_PA10F_PTC_DRV8)
#define PORT_PA10F_PTC_DRV8                        (_UL_(1) << 10)

#define PIN_PA11F_PTC_DRV9                         _UL_(11)    
#define MUX_PA11F_PTC_DRV9                         _UL_(5)     
#define PINMUX_PA11F_PTC_DRV9                      ((PIN_PA11F_PTC_DRV9 << 16) | MUX_PA11F_PTC_DRV9)
#define PORT_PA11F_PTC_DRV9                        (_UL_(1) << 11)

#define PIN_PA14F_PTC_DRV10                        _UL_(14)    
#define MUX_PA14F_PTC_DRV10                        _UL_(5)     
#define PINMUX_PA14F_PTC_DRV10                     ((PIN_PA14F_PTC_DRV10 << 16) | MUX_PA14F_PTC_DRV10)
#define PORT_PA14F_PTC_DRV10                       (_UL_(1) << 14)

#define PIN_PA15F_PTC_DRV11                        _UL_(15)    
#define MUX_PA15F_PTC_DRV11                        _UL_(5)     
#define PINMUX_PA15F_PTC_DRV11                     ((PIN_PA15F_PTC_DRV11 << 16) | MUX_PA15F_PTC_DRV11)
#define PORT_PA15F_PTC_DRV11                       (_UL_(1) << 15)

#define PIN_PA16F_PTC_DRV12                        _UL_(16)    
#define MUX_PA16F_PTC_DRV12                        _UL_(5)     
#define PINMUX_PA16F_PTC_DRV12                     ((PIN_PA16F_PTC_DRV12 << 16) | MUX_PA16F_PTC_DRV12)
#define PORT_PA16F_PTC_DRV12                       (_UL_(1) << 16)

#define PIN_PA17F_PTC_DRV13                        _UL_(17)    
#define MUX_PA17F_PTC_DRV13                        _UL_(5)     
#define PINMUX_PA17F_PTC_DRV13                     ((PIN_PA17F_PTC_DRV13 << 16) | MUX_PA17F_PTC_DRV13)
#define PORT_PA17F_PTC_DRV13                       (_UL_(1) << 17)

